#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```
terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/managedkube/terraform-environments_aws_dev_eks/runs/run-9U9HDFRA56RnsGYC

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.terraform_remote_state.vpc: Refreshing state...
module.my-cluster.data.aws_caller_identity.current: Refreshing state... [id=937803775366]
module.my-cluster.data.aws_partition.current: Refreshing state... [id=aws]
module.my-cluster.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0]: Refreshing state... [id=3407219844]
module.my-cluster.data.aws_ami.eks_worker: Refreshing state... [id=ami-0c62450bce8f4f57f]
module.my-cluster.data.aws_iam_policy_document.cluster_assume_role_policy: Refreshing state... [id=2764486067]
module.my-cluster.aws_security_group.workers[0]: Refreshing state... [id=sg-02ed44a762c57d01b]
module.my-cluster.data.aws_ami.eks_worker_windows: Refreshing state... [id=ami-0c1f1d53c51a53698]
module.my-cluster.aws_security_group.cluster[0]: Refreshing state... [id=sg-0038de2b244f64871]
module.my-cluster.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::937803775366:policy/my-cluster-elb-sl-role-creation20201031041451484500000002]
module.my-cluster.data.aws_iam_policy_document.workers_assume_role_policy: Refreshing state... [id=3778018924]
module.my-cluster.aws_iam_role.cluster[0]: Refreshing state... [id=my-cluster20201031041451485400000003]
module.my-cluster.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=my-cluster20201031041451485400000003-20201031041451801600000005]
module.my-cluster.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=my-cluster20201031041451485400000003-20201031041451857600000006]
module.my-cluster.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=my-cluster20201031041451485400000003-20201031041451924700000007]
module.my-cluster.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=my-cluster20201031041451485400000003-20201031041451966700000008]
module.my-cluster.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-3693974528]
module.my-cluster.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-1562809367]
module.my-cluster.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2074917650]
module.my-cluster.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-812270790]
module.my-cluster.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-3329018518]
module.my-cluster.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-660590597]
module.my-cluster.aws_eks_cluster.this[0]: Refreshing state... [id=my-cluster]
module.my-cluster.data.template_file.userdata[0]: Refreshing state... [id=f0e27a36f49ae3a3d0c6f87ef854a82a9b578af14227ec843b3849103ae9ccce]
module.my-cluster.null_resource.wait_for_cluster[0]: Refreshing state... [id=780882959120660941]
module.my-cluster.aws_iam_role.workers[0]: Refreshing state... [id=my-cluster20201031042935643500000009]
data.aws_eks_cluster.cluster: Refreshing state... [id=my-cluster]
module.my-cluster.local_file.kubeconfig[0]: Refreshing state... [id=e6d917064382b3cccde3f60fb9bda9c742d9384d]
data.aws_eks_cluster_auth.cluster: Refreshing state... [id=my-cluster]
module.my-cluster.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=my-cluster20201031042935643500000009-2020103104293599420000000c]
module.my-cluster.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=my-cluster20201031042935643500000009-2020103104293596950000000b]
module.my-cluster.aws_iam_instance_profile.workers[0]: Refreshing state... [id=my-cluster2020103104293586940000000a]
module.my-cluster.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=my-cluster20201031042935643500000009-2020103104293602280000000d]
module.my-cluster.aws_launch_configuration.workers[0]: Refreshing state... [id=my-cluster-02020103104293692740000000e]
module.my-cluster.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.my-cluster.random_pet.workers[0]: Refreshing state... [id=major-anchovy]
module.my-cluster.aws_autoscaling_group.workers[0]: Refreshing state... [id=my-cluster-02020103104295460640000000f]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      ~ arn                       = "arn:aws:eks:us-west-2:937803775366:cluster/my-cluster" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJd01UQXpNVEEwTWpRMU5Gb1hEVE13TVRBeU9UQTBNalExTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTWxNCk94SkpuWDBoTldqY0xiREVhZkY0bkpQd0pUbnJyeHRncjdwc2pLeUo5NXE4L0RWTFBUT1g5cFdTQzU0RkFPMFoKYTQ2YXdoeGxENFJnUDZySWNMNE9MUGk0TFR6eXRDdTQrMk9VYjBSMkNWck9BMkFLb3NrYVNSSE1TMWZQT1g2MQpXdTJGa29JWTBpRm5uOVFadkR1SE1neGprU01UVmtESitodDMzWE9JYitjTXppNVEzWnNLNW5BYkVNUHRhY21iCnc3WVVXTkJ4cWFCdG5IUExrbzFZY014MVRld2Uxc3NuTzNHbktYbFdldGE3M2xndElDOWo3NlBIQWdsMkdpK2gKNlhtTXU0aHN2L1g2d1kzWUplNjhORmkxRmg0RGl6OUR4UFBBNy82Lzg5S2VVVExIeGlZaUg1alN5UzlHWnhLWApLT3l0WDJzbnI3ZlFCNGx4dWtrQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFDTlA5RnBmUStSUVVLaXVtZWd4WmZoNkVDbEUKYkcybFA2U1U0Q0VsK2lCcEtrR1pMd3dMb1Zyd2VKSi9ocU9SSDlZOThJVDlucmU1OWhiRm43WUhCdnNheEFlbgpvZzAxZjRwclZWcUoxZ3hZV0ZkeVdiQmkrVGkrWUYwYXhLUFVDVnl1NENXOGdXMzd4THdqWDRBRmdSVDF4azRFCjIwSW9Wa1lqRFV2aVNpTGlVM2toR0plS2kwR1kyMHlWWEhGNUpFUGZXV0htZDlNc1hCUUt6bmFyd0FIMEdLdW8KR2ZTMmVPVGVEdXZ3SytmWHdYelNrSmdId0N3ZkFPbVc0UHR4blZyaGU4UW5PYkRWWGVCVGhxS2xqRlVPekxGNQp3b0VXNEhkUWl5SENJaWhxNEhjUllJeXllNGpLVmtPeFNTUEV5VkU2bVhQQWdia2thYkwzRGgyaW5rYz0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
            },
        ] -> (known after apply)
      ~ created_at                = "2020-10-31 04:14:56.456 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [] -> (known after apply)
      ~ endpoint                  = "https://CF0020213CB38B191906A785D1D18B9D.gr7.us-west-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "my-cluster" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-west-2.amazonaws.com/id/CF0020213CB38B191906A785D1D18B9D"
                    },
                ]
            },
        ] -> (known after apply)
      ~ name                      = "my-cluster" -> (known after apply)
      ~ platform_version          = "eks.4" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::937803775366:role/my-cluster20201031041451485400000003" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {} -> (known after apply)
      ~ version                   = "1.17" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "sg-05c3fcd4a18d9f042"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-0038de2b244f64871",
                ]
              - subnet_ids                = [
                  - "subnet-06cce60038989ff23",
                  - "subnet-087b5d06d0b7e72dc",
                  - "subnet-093dd13d5936579f4",
                ]
              - vpc_id                    = "vpc-02f178606795e70af"
            },
        ] -> (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      ~ id    = "my-cluster" -> (known after apply)
      ~ name  = "my-cluster" -> (known after apply)
      ~ token = (sensitive value)
    }

  # aws_kms_key.eks will be created
  + resource "aws_kms_key" "eks" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + description              = "EKS Secret Encryption Key"
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = (known after apply)
    }

  # module.my-cluster.data.template_file.userdata[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "userdata"  {
      ~ id       = "f0e27a36f49ae3a3d0c6f87ef854a82a9b578af14227ec843b3849103ae9ccce" -> (known after apply)
      ~ rendered = <<~EOT
            #!/bin/bash -xe
            
            # Allow user supplied pre userdata code
            
            
            # Bootstrap and join the cluster
            /etc/eks/bootstrap.sh --b64-cluster-ca 'LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJd01UQXpNVEEwTWpRMU5Gb1hEVE13TVRBeU9UQTBNalExTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTWxNCk94SkpuWDBoTldqY0xiREVhZkY0bkpQd0pUbnJyeHRncjdwc2pLeUo5NXE4L0RWTFBUT1g5cFdTQzU0RkFPMFoKYTQ2YXdoeGxENFJnUDZySWNMNE9MUGk0TFR6eXRDdTQrMk9VYjBSMkNWck9BMkFLb3NrYVNSSE1TMWZQT1g2MQpXdTJGa29JWTBpRm5uOVFadkR1SE1neGprU01UVmtESitodDMzWE9JYitjTXppNVEzWnNLNW5BYkVNUHRhY21iCnc3WVVXTkJ4cWFCdG5IUExrbzFZY014MVRld2Uxc3NuTzNHbktYbFdldGE3M2xndElDOWo3NlBIQWdsMkdpK2gKNlhtTXU0aHN2L1g2d1kzWUplNjhORmkxRmg0RGl6OUR4UFBBNy82Lzg5S2VVVExIeGlZaUg1alN5UzlHWnhLWApLT3l0WDJzbnI3ZlFCNGx4dWtrQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFDTlA5RnBmUStSUVVLaXVtZWd4WmZoNkVDbEUKYkcybFA2U1U0Q0VsK2lCcEtrR1pMd3dMb1Zyd2VKSi9ocU9SSDlZOThJVDlucmU1OWhiRm43WUhCdnNheEFlbgpvZzAxZjRwclZWcUoxZ3hZV0ZkeVdiQmkrVGkrWUYwYXhLUFVDVnl1NENXOGdXMzd4THdqWDRBRmdSVDF4azRFCjIwSW9Wa1lqRFV2aVNpTGlVM2toR0plS2kwR1kyMHlWWEhGNUpFUGZXV0htZDlNc1hCUUt6bmFyd0FIMEdLdW8KR2ZTMmVPVGVEdXZ3SytmWHdYelNrSmdId0N3ZkFPbVc0UHR4blZyaGU4UW5PYkRWWGVCVGhxS2xqRlVPekxGNQp3b0VXNEhkUWl5SENJaWhxNEhjUllJeXllNGpLVmtPeFNTUEV5VkU2bVhQQWdia2thYkwzRGgyaW5rYz0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=' --apiserver-endpoint 'https://CF0020213CB38B191906A785D1D18B9D.gr7.us-west-2.eks.amazonaws.com'  --kubelet-extra-args "" 'my-cluster'
            
            # Allow user supplied userdata code
            
        EOT -> (known after apply)
        template = <<~EOT
            #!/bin/bash -xe
            
            # Allow user supplied pre userdata code
            ${pre_userdata}
            
            # Bootstrap and join the cluster
            /etc/eks/bootstrap.sh --b64-cluster-ca '${cluster_auth_base64}' --apiserver-endpoint '${endpoint}' ${bootstrap_extra_args} --kubelet-extra-args "${kubelet_extra_args}" '${cluster_name}'
            
            # Allow user supplied userdata code
            ${additional_userdata}
        EOT
      ~ vars     = {
            "additional_userdata"  = ""
            "bootstrap_extra_args" = ""
          ~ "cluster_auth_base64"  = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJd01UQXpNVEEwTWpRMU5Gb1hEVE13TVRBeU9UQTBNalExTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTWxNCk94SkpuWDBoTldqY0xiREVhZkY0bkpQd0pUbnJyeHRncjdwc2pLeUo5NXE4L0RWTFBUT1g5cFdTQzU0RkFPMFoKYTQ2YXdoeGxENFJnUDZySWNMNE9MUGk0TFR6eXRDdTQrMk9VYjBSMkNWck9BMkFLb3NrYVNSSE1TMWZQT1g2MQpXdTJGa29JWTBpRm5uOVFadkR1SE1neGprU01UVmtESitodDMzWE9JYitjTXppNVEzWnNLNW5BYkVNUHRhY21iCnc3WVVXTkJ4cWFCdG5IUExrbzFZY014MVRld2Uxc3NuTzNHbktYbFdldGE3M2xndElDOWo3NlBIQWdsMkdpK2gKNlhtTXU0aHN2L1g2d1kzWUplNjhORmkxRmg0RGl6OUR4UFBBNy82Lzg5S2VVVExIeGlZaUg1alN5UzlHWnhLWApLT3l0WDJzbnI3ZlFCNGx4dWtrQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFDTlA5RnBmUStSUVVLaXVtZWd4WmZoNkVDbEUKYkcybFA2U1U0Q0VsK2lCcEtrR1pMd3dMb1Zyd2VKSi9ocU9SSDlZOThJVDlucmU1OWhiRm43WUhCdnNheEFlbgpvZzAxZjRwclZWcUoxZ3hZV0ZkeVdiQmkrVGkrWUYwYXhLUFVDVnl1NENXOGdXMzd4THdqWDRBRmdSVDF4azRFCjIwSW9Wa1lqRFV2aVNpTGlVM2toR0plS2kwR1kyMHlWWEhGNUpFUGZXV0htZDlNc1hCUUt6bmFyd0FIMEdLdW8KR2ZTMmVPVGVEdXZ3SytmWHdYelNrSmdId0N3ZkFPbVc0UHR4blZyaGU4UW5PYkRWWGVCVGhxS2xqRlVPekxGNQp3b0VXNEhkUWl5SENJaWhxNEhjUllJeXllNGpLVmtPeFNTUEV5VkU2bVhQQWdia2thYkwzRGgyaW5rYz0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
            "cluster_name"         = "my-cluster"
          ~ "endpoint"             = "https://CF0020213CB38B191906A785D1D18B9D.gr7.us-west-2.eks.amazonaws.com" -> (known after apply)
            "kubelet_extra_args"   = ""
            "platform"             = "linux"
            "pre_userdata"         = ""
        }
    }

  # module.my-cluster.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        arn                       = "arn:aws:autoscaling:us-west-2:937803775366:autoScalingGroup:5616d1cf-d7fa-4fe1-b817-e40b6f7baa48:autoScalingGroupName/my-cluster-02020103104295460640000000f"
        availability_zones        = [
            "us-west-2a",
            "us-west-2b",
            "us-west-2c",
        ]
        default_cooldown          = 300
        desired_capacity          = 1
        enabled_metrics           = []
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "EC2"
        id                        = "my-cluster-02020103104295460640000000f"
      ~ launch_configuration      = "my-cluster-02020103104293692740000000e" -> (known after apply)
        load_balancers            = []
        max_instance_lifetime     = 0
        max_size                  = 5
        metrics_granularity       = "1Minute"
        min_size                  = 1
        name                      = "my-cluster-02020103104295460640000000f"
        name_prefix               = "my-cluster-0"
        protect_from_scale_in     = false
        service_linked_role_arn   = "arn:aws:iam::937803775366:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
        suspended_processes       = [
            "AZRebalance",
        ]
        target_group_arns         = []
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-06cce60038989ff23",
            "subnet-087b5d06d0b7e72dc",
            "subnet-093dd13d5936579f4",
        ]
        wait_for_capacity_timeout = "10m"

        tag {
            key                 = "Name"
            propagate_at_launch = true
            value               = "my-cluster-0-eks_asg"
        }
        tag {
            key                 = "k8s.io/cluster/my-cluster"
            propagate_at_launch = true
            value               = "owned"
        }
        tag {
            key                 = "kubernetes.io/cluster/my-cluster"
            propagate_at_launch = true
            value               = "owned"
        }
    }

  # module.my-cluster.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:us-west-2:937803775366:cluster/my-cluster" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJd01UQXpNVEEwTWpRMU5Gb1hEVE13TVRBeU9UQTBNalExTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTWxNCk94SkpuWDBoTldqY0xiREVhZkY0bkpQd0pUbnJyeHRncjdwc2pLeUo5NXE4L0RWTFBUT1g5cFdTQzU0RkFPMFoKYTQ2YXdoeGxENFJnUDZySWNMNE9MUGk0TFR6eXRDdTQrMk9VYjBSMkNWck9BMkFLb3NrYVNSSE1TMWZQT1g2MQpXdTJGa29JWTBpRm5uOVFadkR1SE1neGprU01UVmtESitodDMzWE9JYitjTXppNVEzWnNLNW5BYkVNUHRhY21iCnc3WVVXTkJ4cWFCdG5IUExrbzFZY014MVRld2Uxc3NuTzNHbktYbFdldGE3M2xndElDOWo3NlBIQWdsMkdpK2gKNlhtTXU0aHN2L1g2d1kzWUplNjhORmkxRmg0RGl6OUR4UFBBNy82Lzg5S2VVVExIeGlZaUg1alN5UzlHWnhLWApLT3l0WDJzbnI3ZlFCNGx4dWtrQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFDTlA5RnBmUStSUVVLaXVtZWd4WmZoNkVDbEUKYkcybFA2U1U0Q0VsK2lCcEtrR1pMd3dMb1Zyd2VKSi9ocU9SSDlZOThJVDlucmU1OWhiRm43WUhCdnNheEFlbgpvZzAxZjRwclZWcUoxZ3hZV0ZkeVdiQmkrVGkrWUYwYXhLUFVDVnl1NENXOGdXMzd4THdqWDRBRmdSVDF4azRFCjIwSW9Wa1lqRFV2aVNpTGlVM2toR0plS2kwR1kyMHlWWEhGNUpFUGZXV0htZDlNc1hCUUt6bmFyd0FIMEdLdW8KR2ZTMmVPVGVEdXZ3SytmWHdYelNrSmdId0N3ZkFPbVc0UHR4blZyaGU4UW5PYkRWWGVCVGhxS2xqRlVPekxGNQp3b0VXNEhkUWl5SENJaWhxNEhjUllJeXllNGpLVmtPeFNTUEV5VkU2bVhQQWdia2thYkwzRGgyaW5rYz0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
            },
        ] -> (known after apply)
      ~ created_at                = "2020-10-31 04:14:56.456 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://CF0020213CB38B191906A785D1D18B9D.gr7.us-west-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "my-cluster" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-west-2.amazonaws.com/id/CF0020213CB38B191906A785D1D18B9D"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "my-cluster"
      ~ platform_version          = "eks.4" -> (known after apply)
        role_arn                  = "arn:aws:iam::937803775366:role/my-cluster20201031041451485400000003"
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
        version                   = "1.17"

      + encryption_config { # forces replacement
          + resources = [
              + "secrets",
            ] # forces replacement

          + provider { # forces replacement
              + key_arn = (known after apply) # forces replacement
            }
        }

        timeouts {
            create = "30m"
            delete = "15m"
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-05c3fcd4a18d9f042" -> (known after apply)
            endpoint_private_access   = false
            endpoint_public_access    = true
            public_access_cidrs       = [
                "0.0.0.0/0",
            ]
            security_group_ids        = [
                "sg-0038de2b244f64871",
            ]
            subnet_ids                = [
                "subnet-06cce60038989ff23",
                "subnet-087b5d06d0b7e72dc",
                "subnet-093dd13d5936579f4",
            ]
          ~ vpc_id                    = "vpc-02f178606795e70af" -> (known after apply)
        }
    }

  # module.my-cluster.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = (known after apply)
    }

  # module.my-cluster.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:us-west-2:937803775366:launchConfiguration:43b52902-fed1-4e83-9284-376ac7e577b5:launchConfigurationName/my-cluster-02020103104293692740000000e" -> (known after apply)
        associate_public_ip_address      = false
        ebs_optimized                    = true
        enable_monitoring                = true
        iam_instance_profile             = "my-cluster2020103104293586940000000a"
      ~ id                               = "my-cluster-02020103104293692740000000e" -> (known after apply)
        image_id                         = "ami-0c62450bce8f4f57f"
        instance_type                    = "m4.large"
      + key_name                         = (known after apply)
      ~ name                             = "my-cluster-02020103104293692740000000e" -> (known after apply)
        name_prefix                      = "my-cluster-0"
        security_groups                  = [
            "sg-02ed44a762c57d01b",
        ]
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLXhlCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgcHJlIHVzZXJkYXRhIGNvZGUKCgojIEJvb3RzdHJhcCBhbmQgam9pbiB0aGUgY2x1c3RlcgovZXRjL2Vrcy9ib290c3RyYXAuc2ggLS1iNjQtY2x1c3Rlci1jYSAnTFMwdExTMUNSVWRKVGlCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2sxSlNVTjVSRU5EUVdKRFowRjNTVUpCWjBsQ1FVUkJUa0puYTNGb2EybEhPWGN3UWtGUmMwWkJSRUZXVFZKTmQwVlJXVVJXVVZGRVJYZHdjbVJYU213S1kyMDFiR1JIVm5wTlFqUllSRlJKZDAxVVFYcE5WRUV3VFdwUk1VNUdiMWhFVkUxM1RWUkJlVTlVUVRCTmFsRXhUa1p2ZDBaVVJWUk5Ra1ZIUVRGVlJRcEJlRTFMWVROV2FWcFlTblZhV0ZKc1kzcERRMEZUU1hkRVVWbEtTMjlhU1doMlkwNUJVVVZDUWxGQlJHZG5SVkJCUkVORFFWRnZRMmRuUlVKQlRXeE5Dazk0U2twdVdEQm9UbGRxWTB4aVJFVmhaa1kwYmtwUWQwcFVibkp5ZUhSbmNqZHdjMnBMZVVvNU5YRTRMMFJXVEZCVVQxZzVjRmRUUXpVMFJrRlBNRm9LWVRRMllYZG9lR3hFTkZKblVEWnlTV05NTkU5TVVHazBURlI2ZVhSRGRUUXJNazlWWWpCU01rTldjazlCTWtGTGIzTnJZVk5TU0UxVE1XWlFUMWcyTVFwWGRUSkdhMjlKV1RCcFJtNXVPVkZhZGtSMVNFMW5lR3ByVTAxVVZtdEVTaXRvZERNeldFOUpZaXRqVFhwcE5WRXpXbk5MTlc1QllrVk5VSFJoWTIxaUNuYzNXVlZYVGtKNGNXRkNkRzVJVUV4cmJ6RlpZMDE0TVZSbGQyVXhjM051VHpOSGJrdFliRmRsZEdFM00yeG5kRWxET1dvM05sQklRV2RzTWtkcEsyZ0tObGh0VFhVMGFITjJMMWcyZDFreldVcGxOamhPUm1reFJtZzBSR2w2T1VSNFVGQkJOeTgyTHpnNVMyVlZWRXhJZUdsWmFVZzFhbE41VXpsSFduaExXQXBMVDNsMFdESnpibkkzWmxGQ05HeDRkV3RyUTBGM1JVRkJZVTFxVFVORmQwUm5XVVJXVWpCUVFWRklMMEpCVVVSQlowdHJUVUU0UjBFeFZXUkZkMFZDQ2k5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWtGRFRsQTVSbkJtVVN0U1VWVkxhWFZ0WldkNFdtWm9Oa1ZEYkVVS1lrY3liRkEyVTFVMFEwVnNLMmxDY0V0clIxcE1kM2RNYjFaeWQyVktTaTlvY1U5U1NEbFpPVGhKVkRsdWNtVTFPV2hpUm00M1dVaENkbk5oZUVGbGJncHZaekF4WmpSd2NsWldjVW94WjNoWlYwWmtlVmRpUW1rclZHa3JXVVl3WVhoTFVGVkRWbmwxTkVOWE9HZFhNemQ0VEhkcVdEUkJSbWRTVkRGNGF6UkZDakl3U1c5V2ExbHFSRlYyYVZOcFRHbFZNMnRvUjBwbFMya3dSMWt5TUhsV1dFaEdOVXBGVUdaWFYwaHRaRGxOYzFoQ1VVdDZibUZ5ZDBGSU1FZExkVzhLUjJaVE1tVlBWR1ZFZFhaM1N5dG1XSGRZZWxOclNtZElkME4zWmtGUGJWYzBVSFI0YmxaeWFHVTRVVzVQWWtSV1dHVkNWR2h4UzJ4cVJsVlBla3hHTlFwM2IwVlhORWhrVVdsNVNFTkphV2h4TkVoalVsbEplWGxsTkdwTFZtdFBlRk5UVUVWNVZrVTJiVmhRUVdkaWEydGhZa3d6UkdneWFXNXJZejBLTFMwdExTMUZUa1FnUTBWU1ZFbEdTVU5CVkVVdExTMHRMUW89JyAtLWFwaXNlcnZlci1lbmRwb2ludCAnaHR0cHM6Ly9DRjAwMjAyMTNDQjM4QjE5MTkwNkE3ODVEMUQxOEI5RC5ncjcudXMtd2VzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ215LWNsdXN0ZXInCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgdXNlcmRhdGEgY29kZQoK" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

        root_block_device {
            delete_on_termination = true
            encrypted             = false
            iops                  = 0
            volume_size           = 100
            volume_type           = "gp2"
        }
    }

  # module.my-cluster.kubernetes_config_map.aws_auth[0] will be updated in-place
  ~ resource "kubernetes_config_map" "aws_auth" {
        binary_data = {}
      ~ data        = {
            "mapAccounts" = jsonencode([])
          ~ "mapRoles"    = <<~EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::937803775366:role/my-cluster20201031042935643500000009"
                  "username": "system:node:{{EC2PrivateDNSName}}"
              + - "groups":
              +   - "system:masters"
              +   "rolearn": "arn:aws:iam::66666666666:role/role1"
              +   "username": "role1"
            EOT
          ~ "mapUsers"    = <<~EOT
              - []
              + - "groups":
              +   - "system:masters"
              +   "userarn": "arn:aws:iam::66666666666:user/user1"
              +   "username": "user1"
              + - "groups":
              +   - "system:masters"
              +   "userarn": "arn:aws:iam::66666666666:user/user2"
              +   "username": "user2"
            EOT
        }
        id          = "kube-system/aws-auth"

        metadata {
            annotations      = {}
            generation       = 0
            labels           = {}
            name             = "aws-auth"
            namespace        = "kube-system"
            resource_version = "889"
            self_link        = "/api/v1/namespaces/kube-system/configmaps/aws-auth"
            uid              = "0d2ca037-aaa5-4020-a54b-55e1a531cb4e"
        }
    }

  # module.my-cluster.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./kubeconfig_my-cluster"
      + id                   = (known after apply)
    }

  # module.my-cluster.random_pet.workers[0] must be replaced
+/- resource "random_pet" "workers" {
      ~ id        = "major-anchovy" -> (known after apply)
      ~ keepers   = {
          - "lc_name" = "my-cluster-02020103104293692740000000e"
        } -> (known after apply) # forces replacement
        length    = 2
        separator = "-"
    }

Plan: 6 to add, 2 to change, 3 to destroy.

```
</details>
*Pusher: @sekka1, Action: `pull_request`*